{
	"intents": [
		{
			"tag": "greeting",
			"patterns": [
				"Hi there",
				"How are you",
				"Is anyone there?",
				"Hey",
				"Hola",
				"Hello",
				"Good day",
				"Hey",
				"Ekse",
				"Hi"
			],
			"responses": [
				"Hi stranger",
				"Yebo yes, how can I help",
				"Namaste !",
				"Hola",
				"Hey dude",
				"You again"
			]
		},
		{
			"tag": "goodbye",
			"patterns": [
				"Bye",
				"See you later",
				"Goodbye",
				"Ok bye",
				"Bye Bye"
			],
			"responses": [
				"See you!",
				"Have a nice day",
				"Sure Bye",
				"Later dude",
				"Sayoonara",
				"Peace out",
				"Sure dude",
				"Ciao"
			]
		},
		{
			"tag": "thanks",
			"patterns": [
				"Thanks",
				"Thank you",
				"That's helpful",
				"Awesome, thanks",
				"Thanks for helping me"
			],
			"responses": [
				"Happy to help!",
				"Any time!",
				"My pleasure",
				"You are welcome",
				"Sure dude"
			]
		},
		{
			"tag": "name",
			"patterns": [
				"What is your name",
				"Whats your name",
				"Tell me your name",
				"Who are you",
				"Ungubani",
				"Tell me about yourself",
				"You are"
			],
			"responses": [
				"I am ChatAlly",
				"My name is ChatAlly",
				"You can call me Ally",
				"I am ChatAlly, my friends call me Ally",
				"ChatAlly is my name"
			]
		},
		{
			"tag": "options",
			"patterns": [
				"What do you do",
				"How can you help",
				"What do you know",
				"What is your purpose",
				"How can you help"
			],
			"responses": [
				"I can tell you about India",
				"I can give you interesting facts about India",
				"Would you like to know about India",
				"I can give you interesting facts about India",
				"I can give you a fact about India"
			]
		},
		{
			"tag": "bored",
			"patterns": [
				"I'm bored",
				"I am bored",
				"Suggest me something",
				"I'm bored. Can you help"
			],
			"responses": [
				"Do you like music",
				"Should I recommend you a song",
				"Do you want to listen to songs",
				"Should I recommend you a movie",
				"Do you want to watch a movie",
				"You should watch a movie",
				"Listen to some songs"
			]
		},
		{
			"tag": "song",
			"patterns": [
				"Share a song",
				"Recommend me some songs",
				"I love music",
				"Recommend me a song I should listen to",
				"Suggest another song",
				"Recommend another song",
				"Suggest a song"
			],
			"responses": [
				"Listen to Wicked Games by Weeknd",
				"Give a listen to Beautiful by Eminem",
				"Shayar by Talhah Yunus is a beautiful song",
				"Wish You Were Here is a classic by Pink Floyd. Stream It",
				"Listen to Punya Paap by Divine"
			]
		},
		{
			"tag": "movie",
			"patterns": [
				"Share a movie",
				"Recommend me a movie",
				"I would watch a movie",
				"Suggest a movie",
				"Suggest another movie",
				"Recommend another movie"
			],
			"responses": [
				"You should watch the great classic The Shawsank Redemption. It is the highest rated movie on IMDb",
				"Gerald's Game is a 2017 American psychological horror thriller. You can watch it if you like psychological thriller",
				"Give a watch to Masaan staring Vicky Kaushal",
				"A Death in the Gunj is one of the best underrated movie. Go watch it you are doing nothing."
			]
		},
		{
			"tag": "India_facts",
			"patterns": [
				"India Facts",
				"India Facts",
				"Give me some facts about IN",
				"Give me some facts about India",
				"India Facts",
				"India interesting facts",
				"India facts",
				"India interesting facts"
			],
			"responses": [
				"India has the largest postal network in the world with over 1, 55,015 post offices. A single post office on an average serves a population of 7,175 people. The floating post office in Dal Lake, Srinagar, was inaugurated in August 2011",
				"The 2011 Kumbh Mela was the largest gathering of people with over 75 million pilgrims. The gathering was so huge that the crowd was visible from space.",
				"Mawsynram, a village on the Khasi Hills, Meghalaya, receives the highest recorded average rainfall in the world.",
				"It took a total of 2,57,00,000 man hours for completion and also weighs as much as 50,000 African elephants. A true engineering and architectural marvel",
				"At an altitude of 2,444 meters, the Chail Cricket Ground in Chail, Himachal Pradesh, is the highest in the world. It was built in 1893 and is a part of the Chail Military School.",
				"Shampoo was invented in India, not the commercial liquid ones but the method by use of herbs. The word 'shampoo' itself has been derived from the Sanskrit word champu, which means to massage.",
				"India has won all 5 men's Kabaddi World Cups held till now and have been undefeated throughout these tournaments. The Indian women's team has also won all Kabaddi World Cups held till date.",
				"In September 2009, India's ISRO Chandrayaan- 1 using its Moon Mineralogy Mapper detected water on the moon for the first time.",
				"The father of India's missile programme had visited Switzerland back in 2006. Upon his arrival, Switzerland declared May 26th as Science Day.",
				"When Dr Rajendra Prasad was appointed the President of India, he only took 50% of his salary, claiming he did not require more than that",
				"The first rocket was so light and small that it was transported on a bicycle to the Thumba Launching Station in Thiruvananthapuram, Kerala",
				"Elephants receive baths, massages and even food at the Punnathoor Cotta Elephant Yard Rejuvenation Centre in Kerala. Now that's a BIG step for the country",
				"India is second only to the USA when it comes to speaking English with around 125 million people speaking the language, which is only 10% of our population. This is expected to grow by quite a margin in the coming years.",
				"Be it because of religious reasons or personal choices or both, around 20-40% of Indians are vegetarians, making it the largest vegetarian-friendly country in the world",
				"India recently overtook the European Union with production reaching over 132.4m tonnes in 2014.",
				"India was the first country to develop extraction and purifying techniques of sugar. Many visitors from abroad learnt the refining and cultivation of sugar from us",
				"Shakuntla Devi was given this title after she demonstrated the calculation of two 13 digit numbers: 7,686,369,774,870 × 2,465,099,745,779 which were picked at random. She answered correctly within 28 seconds.",
				"Rabindranath Tagore is credited not only for writing the Indian national anthem, Jana Gana Mana, but the Bangladeshi national anthem, Amar Sonar Bangla, as well.",
				"SAfter defeating Germany 8-1 in the 1936 Berlin Olympics, Major Dhyan Chand, the wizard of hockey, was summoned by Hitler. He was promised German citizenship, a high post in the German military and the chance to play for the German national side. Dhyan Chand however declined the offer.",
				"Freddie Mercury, the legendary singer of the rock band 'Queen' was born a Parsi with the name Farrokh Bulsara while the famous Oscar winning Hollywood star Ben Kingsley was born Krishna Pandit Bhanji.",
				"The original Indian Plate survives as peninsular India, the oldest and geologically most stable part of India. It extends as far north as the Satpura and Vindhya ranges in central India. These parallel chains run from the Arabian Sea coast in Gujarat in the west to the coal-rich Chota Nagpur Plateau in Jharkhand in the east",
				"India's coastline measures 7,517 kilometres (4,700 mi) in length; of this distance, 5,423 kilometres (3,400 mi) belong to peninsular India and 2,094 kilometres (1,300 mi) to the Andaman, Nicobar, and Lakshadweep island chains.",
				"The Indian climate is strongly influenced by the Himalayas and the Thar Desert, both of which drive the economically and culturally pivotal summer and winter monsoons.",
				"India is a federation with a parliamentary system governed under the Constitution of India—the country's supreme legal document."
			
			]
		},
		{
			"tag": "india_info",
			"patterns": [
				"India",
				"What can you tell me about IN",
				"IN",
				"Tell me about IN",
				"What about IN",
				"What do you know about IN",
				"Tell me more about IN",
				"What can you tell me about IN",
				"Tell me about India",
				"What about India",
				"What do you know about India",
				"Tell me more about India"
			],
			"responses": [
				"According to the Oxford English Dictionary, the name India is derived from the Classical Latin India, a reference to South Asia and an uncertain region to its east; and in turn derived successively from: Hellenistic Greek India ( Ἰνδία); ancient Greek Indos ( Ἰνδός); Old Persian Hindush, an eastern province of the Achaemenid empire; and ultimately its cognate, the Sanskrit Sindhu, or river, specifically the Indus river and, by implication, its well-settled southern basin.[61][62] The ancient Greeks referred to the Indians as Indoi (Ἰνδοί), which translates as 'The people of the Indus'."
			]
		}
		
	]
}